In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({"Jalandhar":[20,31,34,18,20,50],"Chandigarh":[20,30,40,50,60,np.nan]})

In [4]:
df

   Jalandhar  Chandigarh
0         20        20.0
1         31        30.0
2         34        40.0
3         18        50.0
4         20        60.0
5         50         NaN

In [5]:
print("mean age of Jalandhar---",df["Jalandhar"].mean())
print("mean age of Chandigarh---",df["Chandigarh"].mean())

mean age of Jalandhar--- 28.833333333333332
mean age of Chandigarh--- 40.0

In [6]:
df2 = pd.DataFrame({"Name":["Alice","Bob","Charlie","David","Alex"],"Age":[20,25,30,35,40],"City":["NewYork","LosAngeles","Chicago","NewYork","Lasvegas"]})
df2

      Name  Age        City
0    Alice   20     NewYork
1      Bob   25  LosAngeles
2  Charlie   30     Chicago
3    David   35     NewYork
4     Alex   40    Lasvegas

In [7]:
df3 = df2[df2["Age"]>25] 
df3

      Name  Age      City
2  Charlie   30   Chicago
3    David   35   NewYork
4     Alex   40  Lasvegas

In [8]:
df4 = df3[df3["City"].isin(["NewYork"]) | df3["City"].isin(["Chicago"])]
df4

      Name  Age     City
2  Charlie   30  Chicago
3    David   35  NewYork

In [9]:
df5 = pd.DataFrame({"A":[1,2,np.nan,4],"B":[np.nan,2,3,4],"C":[1,np.nan,3,4]})
df5

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  NaN
2  NaN  3.0  3.0
3  4.0  4.0  4.0

In [10]:
df5["B"].fillna(df5["B"].mean(),inplace=True)
df5

C:\Users\DELL\AppData\Local\Temp\ipykernel_12492\442017867.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df5["B"].fillna(df5["B"].mean(),inplace=True)

     A    B    C
0  1.0  3.0  1.0
1  2.0  2.0  NaN
2  NaN  3.0  3.0
3  4.0  4.0  4.0

In [11]:
df5.dropna(inplace=True)

In [12]:
df5

     A    B    C
0  1.0  3.0  1.0
3  4.0  4.0  4.0

In [14]:
df6 =  pd.DataFrame({"Emails":['alice@o7services.com', 'bob@gmail.com', 'charlie@yahoo.com']})

In [16]:
domain = df6.Emails.str.split("@").str[1]
print(domain)

0    o7services.com
1         gmail.com
2         yahoo.com
Name: Emails, dtype: object